Revit 2026 API

# SiteLocationGeoCoordinateSystemDefinition Property

---

The XML string which describes the geographic coordinate system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GeoCoordinateSystemDefinition { get; }
```
```vb
Public ReadOnly Property GeoCoordinateSystemDefinition As String
	Get
```
```cpp
public:
property String^ GeoCoordinateSystemDefinition {
	String^ get ();
}
```
```fsharp
member GeoCoordinateSystemDefinition : string with get
```

#### Property Value

String

If the site does not have a geographic coordinate system, it returns an empty string for this property.

#### Reference

SiteLocation Class

Autodesk.Revit.DB Namespace